---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSet.ForwardIterator
source: html/541ced25-7d64-2741-7aee-e9f70b07989d.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PlanCircuitSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.